src/Reports/ОтчетПоКомментариямНеисправностей/ОтчетПоКомментариямНеисправностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоКомментариямНеисправностей</name>
</mdclass:Report>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/КомментарииНеисправностей/КомментарииНеисправностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомментарииНеисправностей</name>
  <attributes>
    <name>ИспользоватьПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчетПоКомментариямНеисправностей/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
Макет = Отчеты.ОтчетПоКомментариямНеисправностей.ПолучитьМакет("Макет");
ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");
ОблКомментарийОбщие = Макет.ПолучитьОбласть("Комментарий|Общие");
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");
ОблШапкаЕстьНаЛинейке = Макет.ПолучитьОбласть("Шапка|ЕстьНаЛинейке");
ОблКомментарийЕстьНаЛинейке = Макет.ПолучитьОбласть("Комментарий|ЕстьНаЛинейке");
ОблКонецЕстьНаЛинейке = Макет.ПолучитьОбласть("Конец|ЕстьНаЛинейке");
ОблШапкаНетНаЛинейке = Макет.ПолучитьОбласть("Шапка|НетНаЛинейке");
ОблКомментарийНетНаЛинейке = Макет.ПолучитьОбласть("Комментарий|НетНаЛинейке");
ОблКонецНетНаЛинейке = Макет.ПолучитьОбласть("Конец|НетНаЛинейке");
ОблШапкаОбщие.Параметры.ДатаВывода = ТекущаяДата();
ТабДок.Вывести(ОблШапкаОбщие);
Линейки = Справочники.Линейки.Выбрать();
	Пока Линейки.Следующий() Цикл
	ОблШапкаЕстьНаЛинейке.Параметры.Линейка = Линейки.Ссылка;
	ТабДок.Присоединить(ОблШапкаЕстьНаЛинейке);
	КонецЦикла;
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	КомментарииНеисправностейТабличнаяЧасть.Ссылка КАК Ссылка,
	|	КомментарииНеисправностейТабличнаяЧасть.РабочееМесто.Линейка КАК Линейка
	|ИЗ
	|	Справочник.КомментарииНеисправностей.ТабличнаяЧасть КАК КомментарииНеисправностейТабличнаяЧасть
	|ГДЕ
	|	КомментарииНеисправностейТабличнаяЧасть.РабочееМесто В(&СписокРМ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка";
Запрос.УстановитьПараметр("СписокРМ", СписокРМ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаРМ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРМ.Следующий() Цикл
	ОблКомментарийОбщие.Параметры.Комментарий = ВыборкаРМ.Ссылка;
	ОблКомментарийОбщие.Параметры.Код = ВыборкаРМ.Ссылка.Код;
	ТабДок.Вывести(ОблКомментарийОбщие);
	Выборка = ВыборкаРМ.Выбрать();
	Линейки = Справочники.Линейки.Выбрать();
		Пока Линейки.Следующий() Цикл
		Выборка.Сбросить();
			Если Выборка.НайтиСледующий(Новый Структура("Линейка",Линейки.Ссылка)) Тогда
			ТабДок.Присоединить(ОблКомментарийЕстьНаЛинейке);
			Иначе
			ТабДок.Присоединить(ОблКомментарийНетНаЛинейке);
		    КонецЕсли;		
		КонецЦикла; 
	КонецЦикла;
ТабДок.Вывести(ОблКонецОбщие);
Линейки = Справочники.Линейки.Выбрать();
	Пока Линейки.Следующий() Цикл
	ТабДок.Присоединить(ОблКонецЕстьНаЛинейке);
	КонецЦикла;
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
